# RbsElecDemandfactorDemandloadParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecDemandfactorDemandloadParam Property
ParameterTypeId Class See Also
---
"Estimated Demand Load"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecDemandfactorDemandloadParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecDemandfactorDemandloadParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecDemandfactorDemandloadParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace